// Дано натуральное число N. Вывести на экран числа от 1 до N
// i = 1 счетчик цикла

int n = 100;
int i = 1;

while (i <= n) // цикл, пока верно - будет выполняться
{
    //Console.WriteLine(i); // тело цикла
    //Console.Write(i);
    Console.Write(' '); // в одинарных кавычках пробел
    i = i + 1;
}
